readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>readme</title>
<!-- 2014-12-24 Wed 16:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Vivek Srikumar" />
</head>
<body>
<div id="content">
<h1 class="title">readme</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Getting started</a></li>
<li><a href="#sec-2">2. Replicating newsgroup results</a></li>
<li><a href="#sec-3">3. Replicating POS results</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Getting started</h2>
<div class="outline-text-2" id="text-1">
<p>
To compile, you need scala and SBT installed on your computer. The
newsgroup experiments were run with at least 15 GB of RAM. The POS
experiments required much more RAM (over 40GB).
</p>

<p>
First, compile by running
</p>

<div class="org-src-container">

<pre class="src src-bash">sbt compile
</pre>
</div>

<p>
If you want to clean up all the compiled files, delete the <code>target</code>,
<code>lib_managed</code> and <code>project</code> directories.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Replicating newsgroup results</h2>
<div class="outline-text-2" id="text-2">
<p>
To train a multiclass classifier using data that is formatted
in the lib-linear data format, use <code>./run.sh linear</code>. Running this
should list the different command line switches that you can use.
The most important switches are:
</p>

<ol class="org-ol">
<li><code>-n</code>: The dimensionality of the label vectors. If this
dimensionality is more than the number of labels in the problem,
then the dimensionality is set to the number of labels.
</li>

<li><code>-w</code>: Use one-hot vectors only (i.e. do not train label vectors)
</li>
</ol>

<p>
See the documentation for an explanation of the other options. For
every run, the complete log of the execution will be saved in a
subdirectory of the directory experiments.
</p>

<p>
To produce the newsgroup results, the following settings were used.
First, the data:
</p>

<div class="org-src-container">

<pre class="src src-bash">TRAIN_FILE=data/20news/features.extracted/20news-bydate-train-stanford-classifier.txt.feats
TEST_FILE=data/20news/features.extracted/20news-bydate-test-stanford-classifier.txt.feats
</pre>
</div>


<ol class="org-ol">
<li>Baseline: Structured SVM
<div class="org-src-container">

<pre class="src src-bash">./run.sh linear -n 21 \
         -w \
         --train-iters 25 \
         -t $TRAIN_FILE \
         -e $EVAL_FILE \
         -v --cv-iters 5
</pre>
</div>
</li>

<li>DISTRO

<div class="org-src-container">

<pre class="src src-bash">RANDOM_SEED=1 &amp;&amp; ./run.sh linear -n 20 \
                -a l2-prox-alternating \
                --train-iters 20 \
                -t $TRAIN_FILE \
                -e $TEST_FILE \
                --weight-train-iters 5 \
                --label-train-iters 5 \
                --lambda1 0.25 \
                --lambda2 0.004096
</pre>
</div>

<p>
To find the best parameters by cross validation on the training
set, you can remove the <code>--lambda1</code> and <code>=--lambda2</code> options and
replace them with a <code>-v</code> option to indicate five fold cross
validation (as in the baseline). The parameters in the command
above are the result of cross-validation.
</p>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Replicating POS results</h2>
<div class="outline-text-2" id="text-3">
<p>
To replicate the POS tagging results, you need to access the correct
sections of the Penn Treebank and the Basque data in CONLL format.
Use <code>./run.sh pos</code> and <code>./run.sh conll.pos</code> respectively to get
information about the command line options. (The options are very
similar to the newsgroup ones.)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vivek Srikumar</p>
<p class="date">Created: 2014-12-24 Wed 16:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
